anachrocomputer/STM32_I2C_OLED/i2c_oled.c
static void oledData(const uint8_t d)
{
    i2c1_txd(d);
}


/* oledCmd --- send a command byte to the OLED by I2C */

static void oledCmd(const uint8_t c)
{
   i2c1_start();
   i2c1_txa(0x78);
   i2c1_txd(0x00);
   i2c1_txd(c);
   i2c1_stop();
}


/* oledCmd1b --- send two command bytes to the OLED by I2C */

static void oledCmd1b(const uint8_t c, const uint8_t b)
{
   i2c1_start();
   i2c1_txa(0x78);
   i2c1_txd(0x00);
   i2c1_txd(c);
   i2c1_txd(b);
   i2c1_stop();
}


/* updscreen --- update the physical screen from the buffer */

static void updscreen(void)
{
   static uint8_t addrCmd[] = {SSD1306_COLUMNADDR, 0, MAXX - 1, SSD1306_PAGEADDR, 4, 7};
   int r, c;
   
   i2c1_start();
   i2c1_txa(0x78);
   i2c1_txd(0x00);
   i2c1_txd(SSD1306_COLUMNADDR);
   i2c1_txd(0);
   i2c1_txd(MAXX - 1);
   i2c1_stop();
   
   i2c1_start();
   i2c1_txa(0x78);
   i2c1_txd(0x00);
   i2c1_txd(SSD1306_PAGEADDR);
   i2c1_txd(4);
   i2c1_txd(7);
   i2c1_stop();
   
   i2c1_start();
   i2c1_txa(0x78);
   i2c1_txd(0x40);
   
   for (r = 0; r < MAXROWS; r++)
      for (c = 0; c < MAXX; c++)
         i2c1_txd(Frame[r][c]);
   
   i2c1_stop();
}


/* OLED_begin --- initialise the SSD1306 OLED */

void OLED_begin(const int wd, const int ht)
{
    // Init sequence for SSD1306 128x64 or 128x32 OLED module
    oledCmd(SSD1306_DISPLAYOFF);                    // 0xAE
    oledCmd1b(SSD1306_SETDISPLAYCLOCKDIV, 0x80);    // 0xD5, the suggested ratio 0x80
    oledCmd1b(SSD1306_SETMULTIPLEX, 0x3F);          // 0xA8
    oledCmd1b(SSD1306_SETDISPLAYOFFSET, 0x00);      // 0xD3, no offset
    oledCmd(SSD1306_SETSTARTLINE | 0x0);            // line #0
    oledCmd1b(SSD1306_CHARGEPUMP, 0x14);            // 0x8D
    oledCmd1b(SSD1306_MEMORYMODE, 0x00);            // 0x20, 0x00 act like ks0108
    oledCmd(SSD1306_SEGREMAP | 0x1);
    oledCmd(SSD1306_COMSCANDEC);
    
    if (ht < 64)
    {
        oledCmd1b(SSD1306_SETCOMPINS, 0x02);        // 0xDA
    }
    else
    {
        oledCmd1b(SSD1306_SETCOMPINS, 0x12);        // 0xDA
    }
    
    oledCmd1b(SSD1306_SETCONTRAST, 0xCF);           // 0x81
    oledCmd1b(SSD1306_SETPRECHARGE, 0xF1);          // 0xd9
    oledCmd1b(SSD1306_SETVCOMDETECT, 0x40);         // 0xDB
    oledCmd(SSD1306_DISPLAYALLON_RESUME);           // 0xA4
    oledCmd(SSD1306_NORMALDISPLAY);                 // 0xA6

    oledCmd(SSD1306_DISPLAYON); // Turn on OLED panel
}


/* greyFrame --- clear entire frame to checkerboard pattern */

void greyFrame(void)
{
    int r, c;

    for (r = 0; r < MAXROWS; r++)
    {
        for (c = 0; c < MAXX; c += 2)
        {
            Frame[r][c] = 0xaa;
            Frame[r][c + 1] = 0x55;
        }
    }
}


/* setPixel --- set a single pixel */

void setPixel(const unsigned int x, const unsigned int y)
{
    if ((x < MAXX) && (y < MAXY))
        Frame[y / 8][x] |= 1 << (y & 7);
    else
    {
//      Serial.print("setPixel(");
//      Serial.print(x);
//      Serial.print(",");
//      Serial.print(y);
//      Serial.println(")");
    }
}


/* clrPixel --- clear a single pixel */

void clrPixel(const unsigned int x, const unsigned int y)
{
    if ((x < MAXX) && (y < MAXY))
        Frame[y / 8][x] &= ~(1 << (y & 7));
    else
    {
//      Serial.print("clrPixel(");
//      Serial.print(x);
//      Serial.print(",");
//      Serial.print(y);
//      Serial.println(")");
    }
}


/* setVline --- draw vertical line */

void setVline(const unsigned int x, const unsigned int y1, const unsigned int y2)
{
    unsigned int y;

    for (y = y1; y <= y2; y++)
        setPixel(x, y);
}


/* clrVline --- draw vertical line */

void clrVline(const unsigned int x, const unsigned int y1, const unsigned int y2)
{
    unsigned int y;

    for (y = y1; y <= y2; y++)
        clrPixel(x, y);
}


/* setHline --- set pixels in a horizontal line */

void setHline(const unsigned int x1, const unsigned int x2, const unsigned int y)
{
    unsigned int x;
    const unsigned int row = y / 8;
    const uint8_t b = 1 << (y  & 7);

    for (x = x1; x <= x2; x++)
        Frame[row][x] |= b;
}


/* clrHline --- clear pixels in a horizontal line */

void clrHline(const unsigned int x1, const unsigned int x2, const unsigned int y)
{
    unsigned int x;
    const unsigned int row = y / 8;
    const uint8_t b = ~(1 << (y  & 7));

    for (x = x1; x <= x2; x++)
      Frame[row][x] &= b;
}


/* setRect --- set pixels in a (non-filled) rectangle */

void setRect(const int x1, const int y1, const int x2, const int y2)
{
    setHline(x1, x2, y1);
    setVline(x2, y1, y2);
    setHline(x1, x2, y2);
    setVline(x1, y1, y2);
}


/* fillRect --- set pixels in a filled rectangle */

void fillRect(const int x1, const int y1, const int x2, const int y2, const int ec, const int fc)
{
    int y;

    for (y = y1; y <= y2; y++)
        if (fc == 0)
            clrHline(x1, x2, y);
        else if (fc == 1)
            setHline(x1, x2, y);

    if (ec == 1)
    {
        setHline(x1, x2, y1);
        setVline(x2, y1, y2);
        setHline(x1, x2, y2);
        setVline(x1, y1, y2);
    }
    else if (ec == 0)
    {
        clrHline(x1, x2, y1);
        clrVline(x2, y1, y2);
        clrHline(x1, x2, y2);
        clrVline(x1, y1, y2);
    }
}

#define  WD  (15)    // Width of digit (X-coord of rightmost pixel of segments 'b' and 'c')
#define  GY  (13)    // Y-coord of 'g' segment of Panaplex (slightly above half-way)

void drawLed(const int x0, int x, int y)
{
   x *= 4;
   y *= 4;
   
   x += x0;
   y += 3;
   
   setHline(x, x + 2, y + 0);
   setHline(x, x + 2, y + 1);
   setHline(x, x + 2, y + 2);
}


void drawSegA(const int x, const int style)
{
   switch (style) {
   case PANAPLEX_STYLE:
      setHline(x, x + WD, 0);
      setHline(x, x + WD, 1);
      break;
   case LED_DOT_STYLE:
      drawLed(x, 1, 0);
      drawLed(x, 2, 0);
      break;
   case LED_BAR_STYLE:
      setHline(x + 3, x + WD - 3, 0);
      setHline(x + 3, x + WD - 3, 1);
      setHline(x + 3, x + WD - 3, 2);
      break;
   case VFD_STYLE:
      setHline(x + 1, x + WD - 1, 0);
      setHline(x + 2, x + WD - 2, 1);
      setHline(x + 3, x + WD - 3, 2);
      break;
   }
}


void drawSegB(const int x, const int style)
{
   switch (style) {
   case PANAPLEX_STYLE:
      setVline(x + WD,     0, GY);
      setVline(x + WD - 1, 0, GY);
      break;
   case LED_DOT_STYLE:
      drawLed(x, 3, 1);
      drawLed(x, 3, 2);
      break;
   case LED_BAR_STYLE:
      setVline(x + WD,     3, 14);
      setVline(x + WD - 1, 3, 14);
      setVline(x + WD - 2, 3, 14);
      break;
   case VFD_STYLE:
      setVline(x + WD,     1, 13);
      setVline(x + WD - 1, 2, 14);
      setVline(x + WD - 2, 3, 13);
      break;
   }
}


void drawSegC(const int x, const int style)
{
   switch (style) {
   case PANAPLEX_STYLE:
      setVline(x + WD,     GY, 31);
      setVline(x + WD - 1, GY, 31);
      break;
   case LED_DOT_STYLE:
      drawLed(x, 3, 4);
      drawLed(x, 3, 5);
      break;
   case LED_BAR_STYLE:
      setVline(x + WD,     18, 28);
      setVline(x + WD - 1, 18, 28);
      setVline(x + WD - 2, 18, 28);
      break;
   case VFD_STYLE:
      setVline(x + WD,     19, 30);
      setVline(x + WD - 1, 18, 29);
      setVline(x + WD - 2, 19, 28);
      break;
   }
}


