anachrocomputer/STM32_I2C_OLED/i2c_oled.c
void drawSegD(const int x, const int style)
{
   switch (style) {
   case PANAPLEX_STYLE:
      setHline(x, x + WD, 31);
      setHline(x, x + WD, 30);
      break;
   case LED_DOT_STYLE:
      drawLed(x, 1, 6);
      drawLed(x, 2, 6);
      break;
   case LED_BAR_STYLE:
      setHline(x + 3, x + WD - 3, 31);
      setHline(x + 3, x + WD - 3, 30);
      setHline(x + 3, x + WD - 3, 29);
      break;
   case VFD_STYLE:
      setHline(x + 1, x + WD - 1, 31);
      setHline(x + 2, x + WD - 2, 30);
      setHline(x + 3, x + WD - 3, 29);
      break;
   }
}


void drawSegE(const int x, const int style)
{
   switch (style) {
   case PANAPLEX_STYLE:
      setVline(x + 0, GY, 31);
      setVline(x + 1, GY, 31);
      break;
   case LED_DOT_STYLE:
      drawLed(x, 0, 4);
      drawLed(x, 0, 5);
      break;
   case LED_BAR_STYLE:
      setVline(x + 0, 18, 28);
      setVline(x + 1, 18, 28);
      setVline(x + 2, 18, 28);
      break;
   case VFD_STYLE:
      setVline(x + 0, 17, 30);
      setVline(x + 1, 18, 29);
      setVline(x + 2, 19, 28);
      break;
   }
}


void drawSegF(const int x, const int style)
{
   switch (style) {
   case PANAPLEX_STYLE:
      setVline(x + 0, 0, GY);
      setVline(x + 1, 0, GY);
      break;
   case LED_DOT_STYLE:
      drawLed(x, 0, 1);
      drawLed(x, 0, 2);
      break;
   case LED_BAR_STYLE:
      setVline(x + 0, 3, 14);
      setVline(x + 1, 3, 14);
      setVline(x + 2, 3, 14);
      break;
   case VFD_STYLE:
      setVline(x + 0, 1, 15);
      setVline(x + 1, 2, 14);
      setVline(x + 2, 3, 13);
      break;
   }
}


void drawSegG(const int x, const int style)
{
   switch (style) {
   case PANAPLEX_STYLE:
      setHline(x, x + WD, GY);
      setHline(x, x + WD, GY + 1);
      break;
   case LED_DOT_STYLE:
      drawLed(x, 1, 3);
      drawLed(x, 2, 3);
      break;
   case LED_BAR_STYLE:
      setHline(x + 3, x + WD - 3, 15);
      setHline(x + 3, x + WD - 3, 16);
      setHline(x + 3, x + WD - 3, 17);
      break;
   case VFD_STYLE:
      setHline(x + 2, x + WD - 2, 15);
      setHline(x + 1, x + WD - 1, 16);
      setHline(x + 2, x + WD - 2, 17);
      break;
   }
}


void drawSegH(const int x, const int style)
{
   switch (style) {
   case PANAPLEX_STYLE:
      setHline(x + WD, x + WD + 3, GY);
      setHline(x + WD, x + WD + 3, GY + 1);
      break;
   case LED_DOT_STYLE:
      drawLed(x, 4, 3);
      break;
   case LED_BAR_STYLE:
      setHline(x + WD + 1, x + WD + 3, 15);
      setHline(x + WD + 1, x + WD + 3, 16);
      setHline(x + WD + 1, x + WD + 3, 17);
      break;
   case VFD_STYLE:
      setHline(x + WD,     x + WD + 3, 15);
      setHline(x + WD - 1, x + WD + 3, 16);
      setHline(x + WD,     x + WD + 3, 17);
      break;
   }
}


void drawSegI(const int x, const int style)
{
   switch (style) {
   case LED_DOT_STYLE:
      drawLed(x, 0, 0);
      break;
   }
}


void drawSegJ(const int x, const int style)
{
   switch (style) {
   case LED_DOT_STYLE:
      drawLed(x, 3, 0);
      break;
   }
}


void drawSegK(const int x, const int style)
{
   switch (style) {
   case LED_DOT_STYLE:
      drawLed(x, 3, 3);
      break;
   }
}


void drawSegL(const int x, const int style)
{
   switch (style) {
   case LED_DOT_STYLE:
      drawLed(x, 3, 6);
      break;
   }
}


void drawSegM(const int x, const int style)
{
   switch (style) {
   case LED_DOT_STYLE:
      drawLed(x, 0, 6);
      break;
   }
}


void drawSegN(const int x, const int style)
{
   switch (style) {
   case LED_DOT_STYLE:
      drawLed(x, 0, 3);
      break;
   }
}


void drawSegDP(const int x, const int style)
{
   switch (style) {
   case PANAPLEX_STYLE:
      setHline(x + WD + 2, x + WD + 4, 29);
      setHline(x + WD + 2, x + WD + 4, 30);
      setHline(x + WD + 2, x + WD + 4, 31);
      break;
   case LED_DOT_STYLE:
      drawLed(x, 4, 6);
      break;
   case LED_BAR_STYLE:
   case VFD_STYLE:
      setHline(x + WD + 2, x + WD + 4, 29);
      setHline(x + WD + 2, x + WD + 4, 30);
      setHline(x + WD + 2, x + WD + 4, 31);
      break;
   }
}


void drawSegCN(const int x, const int style)
{
   switch (style) {
   case PANAPLEX_STYLE:
      setHline(x + WD + 2, x + WD + 3,  9);
      setHline(x + WD + 2, x + WD + 3, 10);
      setHline(x + WD + 2, x + WD + 3, 17);
      setHline(x + WD + 2, x + WD + 3, 18);
      break;
   case LED_DOT_STYLE:
      drawLed(x, 4, 2);
      drawLed(x, 4, 4);
      break;
   case LED_BAR_STYLE:
   case VFD_STYLE:
      setHline(x + WD + 2, x + WD + 4, 11);
      setHline(x + WD + 2, x + WD + 4, 12);
      setHline(x + WD + 2, x + WD + 4, 13);
      setHline(x + WD + 2, x + WD + 4, 19);
      setHline(x + WD + 2, x + WD + 4, 20);
      setHline(x + WD + 2, x + WD + 4, 21);
      break;
   }
}


/* renderHexDigit --- draw a single digit into the frame buffer in a given style */

void renderHexDigit(const int x, const int digit, const int style)
{
   switch (digit) {
   case 0:
      drawSegA(x, style);
      drawSegB(x, style);
      drawSegC(x, style);
      drawSegD(x, style);
      drawSegE(x, style);
      drawSegF(x, style);
      drawSegK(x, style);
      drawSegN(x, style);
      break;
   case 1:
      drawSegB(x, style);
      drawSegC(x, style);
      drawSegJ(x, style);
      drawSegK(x, style);
      drawSegL(x, style);
      break;
   case 2:
      drawSegA(x, style);
      drawSegB(x, style);
      drawSegD(x, style);
      drawSegE(x, style);
      drawSegG(x, style);
      drawSegI(x, style);
      drawSegL(x, style);
      drawSegM(x, style);
      break;
   case 3:
      drawSegA(x, style);
      drawSegB(x, style);
      drawSegC(x, style);
      drawSegD(x, style);
      drawSegG(x, style);
      drawSegI(x, style);
      drawSegM(x, style);
      break;
   case 4:
      drawSegB(x, style);
      drawSegC(x, style);
      drawSegF(x, style);
      drawSegG(x, style);
      drawSegH(x, style);  // Special segment just for 4
      drawSegI(x, style);
      drawSegJ(x, style);
      drawSegK(x, style);
      drawSegL(x, style);
      break;
   case 5:
      drawSegA(x, style);
      drawSegC(x, style);
      drawSegD(x, style);
      drawSegF(x, style);
      drawSegG(x, style);
      drawSegI(x, style);
      drawSegJ(x, style);
      drawSegM(x, style);
      break;
   case 6:
      drawSegA(x, style);
      drawSegC(x, style);
      drawSegD(x, style);
      drawSegE(x, style);
      drawSegF(x, style);
      drawSegG(x, style);
      drawSegJ(x, style);
      drawSegN(x, style);
      break;
   case 7:
      drawSegA(x, style);
      drawSegB(x, style);
      drawSegC(x, style);
      drawSegF(x, style);  // Hooked 7
      drawSegI(x, style);
      drawSegJ(x, style);
      drawSegK(x, style);
      drawSegL(x, style);
      break;
   case 8:
      drawSegA(x, style);
      drawSegB(x, style);
      drawSegC(x, style);
      drawSegD(x, style);
      drawSegE(x, style);
      drawSegF(x, style);
      drawSegG(x, style);
      break;
   case 9:
      drawSegA(x, style);
      drawSegB(x, style);
      drawSegC(x, style);
      drawSegD(x, style);
      drawSegF(x, style);
      drawSegG(x, style);
      drawSegK(x, style);
      drawSegM(x, style);
      break;
   case 0xA:
      drawSegA(x, style);
      drawSegB(x, style);
      drawSegC(x, style);
      drawSegE(x, style);
      drawSegF(x, style);
      drawSegG(x, style);
      drawSegK(x, style);
      drawSegL(x, style);
      drawSegM(x, style);
      drawSegN(x, style);
      break;
   case 0xB:
      drawSegC(x, style);     // Lowercase 'b'
      drawSegD(x, style);
      drawSegE(x, style);
      drawSegF(x, style);
      drawSegG(x, style);
      if (style == LED_DOT_STYLE) {
         drawSegA(x, style);  // Uppercase 'B'
         drawSegB(x, style);
         drawSegI(x, style);
         drawSegM(x, style);
         drawSegN(x, style);
      }
      break;
   case 0xC:
      drawSegA(x, style);
      drawSegD(x, style);
      drawSegE(x, style);
      drawSegF(x, style);
      drawSegJ(x, style);
      drawSegL(x, style);
      drawSegN(x, style);
      break;
   case 0xD:
      if (style == LED_DOT_STYLE) {
         drawSegA(x, style);  // Uppercase 'D'
         drawSegB(x, style);
         drawSegC(x, style);
         drawSegD(x, style);
         drawSegE(x, style);
         drawSegF(x, style);
         drawSegI(x, style);
         drawSegK(x, style);
         drawSegM(x, style);
         drawSegN(x, style);
      }
      else {
         drawSegB(x, style);  // Lowercase 'd'
         drawSegC(x, style);
         drawSegD(x, style);
         drawSegE(x, style);
         drawSegG(x, style);
      }
      break;
   case 0xE:
      drawSegA(x, style);
      drawSegD(x, style);
      drawSegE(x, style);
      drawSegF(x, style);
      drawSegG(x, style);
      drawSegI(x, style);
      drawSegJ(x, style);
      drawSegL(x, style);
      drawSegM(x, style);
      drawSegN(x, style);
      break;
   case 0xF:
      drawSegA(x, style);
      drawSegE(x, style);
      drawSegF(x, style);
      drawSegG(x, style);
      drawSegI(x, style);
      drawSegJ(x, style);
      drawSegM(x, style);
      drawSegN(x, style);
      break;
   }
}


/* renderClockDisplay --- draw the six clock digits into the frame buffer */

void renderClockDisplay(const int width, const int style)
{
   renderHexDigit(0 * width, Hour / 10, style);
   renderHexDigit(1 * width, Hour % 10, style);
   
